<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.Adobe.AcrobatDC</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobeAcrobatDC</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Adobe</string>
            <key>ADMIN_PRIVILEGES_ENABLED</key>
            <false/>
            <key>APPS_PANEL_ENABLED</key>
            <false/>
            <key>BASE_VERSION</key>
            <string></string>
            <key>INCLUDE_UPDATES</key>
            <true/>
            <key>LICENSE_TYPE</key>
            <string>team</string>
            <key>ORG_NAME</key>
            <string>ADMIN_PLEASE_CHANGE</string>
            <key>PRODUCT_ID</key>
            <string>APRO</string>
            <key>RUM_ENABLED</key>
            <true/>
            <key>UPDATES_ENABLED</key>
            <false/>
            <key>VERSION</key>
            <string>15.0</string>
            <key>parse_proxy_xml</key>
            <true/>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>Adobe Acrobat</string>
                    <string>Acrobat Distiller</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.mosen.munki.Adobe.CreativeCloudApp</string>
    </dict>
</plist>
