<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.AdobePhotoshopCC2017</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Adobe/CC2017</string>
            <key>NAME</key>
            <string>AdobePhotoshopCC2017</string>
            <key>ccpinfo</key>
            <dict>
                <key>matchOSLanguage</key>
                <true/>
                <key>rumEnabled</key>
                <true/>
                <key>updatesEnabled</key>
                <false/>
                <key>appsPanelEnabled</key>
                <false/>
                <key>adminPrivilegesEnabled</key>
                <false/>
                <key>organizationName</key>
                <string>ADMIN_PLEASE_CHANGE</string>
                <key>customerType</key>
                <string>team</string>
                <key>Language</key>
                <string>en_US</string>
                <key>Products</key>
                <array>
                    <dict>
                        <key>sapCode</key>
                        <string>PHSP</string>
                        <key>baseVersion</key>
                        <string>18.0</string>
                        <key>version</key>
                        <string>latest</string>
                    </dict>
                </array>
            </dict>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <!-- Creative Cloud / Installer -->
                    <string>Creative Cloud</string>
                    <string>Adobe Application Manager</string>
                    <string>AAM Updates Notifier</string>
                    <string>Adobe Application Manager (Updater)</string>

                    <string>Adobe Photoshop CC 2017</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.mosen.munki.Adobe.CreativeCloudApp</string>
    </dict>
</plist>
