<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.jss.AdobeAuditionCC2017</string>
        <key>Input</key>
        <dict>
            <!-- CreativeCloudApp -->
            <key>NAME</key>
            <string>AdobeAuditionCC2017</string>
            <key>ccpinfo</key>
            <dict>
                <key>matchOSLanguage</key>
                <true/>
                <key>rumEnabled</key>
                <true/>
                <key>updatesEnabled</key>
                <false/>
                <key>appsPanelEnabled</key>
                <true/>
                <key>adminPrivilegesEnabled</key>
                <true/>
                <key>organizationName</key>
                <string>ADMIN_PLEASE_CHANGE</string>
                <key>customerType</key>
                <string>team</string>
                <key>Language</key>
                <string>en_US</string>
                <key>Products</key>
                <array>
                    <dict>
                        <key>sapCode</key>
                        <string>AUDT</string>
                        <key>baseVersion</key>
                        <string>10.0.0</string>
                        <key>version</key>
                        <string>latest</string>
                    </dict>
                </array>
            </dict>
            
            <key>fetch_description</key>
            <true/>
            <key>fetch_icon</key>
            <true/>

            <!-- JSSImporter -->
            <key>CATEGORY</key>
            <string>Sound</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>PolicyTemplate.xml</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.mosen.jss.Adobe.CreativeCloudApp</string>
    </dict>
</plist>
