<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.jss.Adobe.AuditionCC</string>
        <key>Input</key>
        <dict>
            <!-- CreativeCloudApp -->
            <key>NAME</key>
            <string>AdobeAuditionCC</string>
            <key>ADMIN_PRIVILEGES_ENABLED</key>
            <false/>
            <key>APPS_PANEL_ENABLED</key>
            <false/>
            <key>BASE_VERSION</key>
            <string></string>
            <key>INCLUDE_UPDATES</key>
            <true/>
            <key>LICENSE_TYPE</key>
            <string>team</string>
            <key>ORG_NAME</key>
            <string>ADMIN_PLEASE_CHANGE</string>
            <key>PRODUCT_ID</key>
            <string>AUDT</string>
            <key>RUM_ENABLED</key>
            <true/>
            <key>UPDATES_ENABLED</key>
            <false/>
            <key>VERSION</key>
            <string>latest</string>
            <key>fetch_description</key>
            <true/>
            <key>fetch_icon</key>
            <true/>

            <!-- JSSImporter -->
            <key>CATEGORY</key>
            <string>Sound</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>PolicyTemplate.xml</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.mosen.jss.Adobe.CreativeCloudApp</string>
    </dict>
</plist>
