<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.pkg.Adobe.BridgeCC</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobeBridgeCC</string>
            <key>ORG_NAME</key>
            <string>ADMIN_PLEASE_CHANGE</string>
            <key>ccpinfo</key>
            <dict>
                <key>matchOSLanguage</key>
                <true/>
                <key>rumEnabled</key>
                <true/>
                <key>updatesEnabled</key>
                <false/>
                <key>appsPanelEnabled</key>
                <true/>
                <key>adminPrivilegesEnabled</key>
                <true/>
                <key>IncludeUpdates</key>
                <true/>
                <key>is64Bit</key>
                <true/>
                <key>organizationName</key>
                <string>ADMIN_PLEASE_CHANGE</string>
                <key>customerType</key>
                <string>team</string>
                <key>Language</key>
                <string>en_US</string>
                <key>Products</key>
                <array>
                    <dict>
                        <key>sapCode</key>
                        <string>KBRG</string>
                        <key>baseVersion</key>
                        <string></string>
                        <key>version</key>
                        <string>latest</string>
                    </dict>
                </array>
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.mosen.pkg.Adobe.CreativeCloudApp</string>
    </dict>
</plist>
