<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.Adobe.CameraRawCC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeCameraRawCC</string>
		<key>ORG_NAME</key>
		<string>ADMIN_PLEASE_CHANGE</string>

		<key>ccpinfo</key>
		<dict>
			<key>matchOSLanguage</key>
			<true/>
			<key>rumEnabled</key>
			<true/>
			<key>updatesEnabled</key>
			<false/>
			<key>appsPanelEnabled</key>
			<true/>
			<key>adminPrivilegesEnabled</key>
			<true/>
			<key>IncludeUpdates</key>
			<true/>
			<key>is64Bit</key>
			<true/>
			<key>organizationName</key>
			<string>ADMIN_PLEASE_CHANGE</string>
			<key>customerType</key>
			<string>team</string>
			<key>Language</key>
			<string>en_US</string>
			<key>Products</key>
			<array>
				<dict>
					<key>sapCode</key>
					<string>ACR</string>
					<key>baseVersion</key>
					<string></string>
					<key>version</key>
					<string>latest</string>
				</dict>
			</array>
		</dict>

		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Adobe</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<!-- Creative Cloud -->
				<string>Creative Cloud</string>
				<string>Adobe Application Manager</string>
				<string>AAM Updates Notifier</string>
				<string>Adobe Application Manager (Updater)</string>
				<!-- Setup app -->

				<!-- Camera Raw -->
				<string>Adobe After Effects CC 2017</string>
				<string>Adobe After Effects CC</string>
				<string>Adobe Bridge CC 2017</string>
				<string>Adobe Photoshop CC 2015</string>
				<string>Adobe Photoshop CC 2017</string>
				<string>Adobe Bridge CC 2015</string>
				<string>Adobe After Effects CC 2015.3 (13.8)</string>
				<string>Adobe Photoshop CC 2015.5</string>
				<string>Adobe Animate CC 2017</string>
				<string>Adobe Photoshop CC 2014</string>
				<string>Adobe Bridge CC</string>
				<string>Adobe Animate CC 2015.2</string>
				<string>Adobe Photoshop CC</string>
				<string>Adobe After Effects CC 2014</string>
				<string>Adobe After Effects CC 2015</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mosen.munki.Adobe.CreativeCloudApp</string>
</dict>
</plist>
