<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Run Adobe CCP to package the latest version of Adobe Prelude CC, and import into Munki</string>
    <key>Identifier</key>
    <string>local.munki.Adobe.PreludeCC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobePreludeCC</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Adobe</string>
        <key>ADMIN_PRIVILEGES_ENABLED</key>
        <false/>
        <key>APPS_PANEL_ENABLED</key>
        <false/>
        <key>BASE_VERSION</key>
        <string></string>
        <key>INCLUDE_UPDATES</key>
        <true/>
        <key>LICENSE_TYPE</key>
        <string>team</string>
        <key>ORG_NAME</key>
        <string>ADMIN_PLEASE_CHANGE</string>
        <key>PRODUCT_ID</key>
        <string>PRLD</string>
        <key>RUM_ENABLED</key>
        <true/>
        <key>UPDATES_ENABLED</key>
        <false/>
        <key>VERSION</key>
        <string>latest</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.munki.Adobe.CreativeCloudApp</string>
</dict>
</plist>
