<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Example Creative Cloud Application import into Munki</string>
        <key>Identifier</key>
        <string>com.github.mosen.munki.Adobe.CreativeCloudApp</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobePhotoshopCC2017</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>test/AdobeCCPAutomation</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.mosen.pkg.Adobe.CreativeCloudApp</string>
        <key>Process</key>
        <array>
            <!-- Build the installer DMG for Munki containing the entire Build directory,
            so that items like the .ccp file persists with the installer. This may be
            useful for auditing purposes later. -->
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Install-%version%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%uninstaller_pkg_path%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall-%version%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                        <key>minimum_os_version</key>
                        <string>%minimum_os_version%</string>
                        <key>display_name</key>
                        <string>%display_name%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <!-- TODO: MunkiImporter doesn't currently handle copying uninstaller pkgs -->
                    <key>additional_makepkginfo_options</key>
                    <array>
                        <string>--uninstallpkg</string>
                        <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall-%version%.dmg</string>
                    </array>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Install-%version%.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
