<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Build and import a Serialized Creative Cloud Application (without CCDA) into munki</string>
        <key>Identifier</key>
        <string>com.github.mosen.munki.Adobe.CreativeCloudAppSerialized</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/AdobeCC</string>
            <!-- pkginfo: supply for example your own description, category, etc.
                 The following elements are set automatically according to Adobe's package metadata,
                 however you may still override them yourself:
                 - display_name
                 - minimum_os_version
            -->
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>developer</key>
                <string>Adobe</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.mosen.pkg.Adobe.CreativeCloudApp</string>
        <key>Process</key>
        <array>
            <!-- Build the installer DMG for Munki containing the entire Build directory,
            so that items like the .ccp file persists with the installer. This may be
            useful for auditing purposes later. -->
            <dict>
                <key>Processor</key>
                <string>CreativeCloudBuildModifier</string>
                <key>Arguments</key>
                <dict>
                    <key>suppress_ccda</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%pkg_path%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Install-%user_facing_version%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%uninstaller_pkg_path%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall-%user_facing_version%.dmg</string>
                </dict>
            </dict>
			<!-- Merge in a few items set by CreativeCloudPackager -->
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
			<!-- Set the shorter, 'marketing' version for the pkginfo -->
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%user_facing_version%</string>
					</dict>
				</dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Install-%user_facing_version%.dmg</string>
                    <key>uninstaller_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%_Uninstall-%user_facing_version%.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
