<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Example Adobe Creative Cloud Package</string>
        <key>Identifier</key>
        <string>com.github.mosen.pkg.Adobe.CreativeCloudApp</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobePhotoshopCC2017</string>
            <!-- Org name is shown in the upper right hand corner of the Enterprise Dashboard web interface -->
            <key>ORG_NAME</key>
            <string>ADMIN_PLEASE_CHANGE</string>
            <!-- 'enterprise' or 'team', or left blank we will read from CCP's prefs -->
            <key>LICENSE_TYPE</key>
            <string></string>
            <key>PRODUCT_ID</key>
            <string>PHSP</string>
            <key>BASE_VERSION</key>
            <string>18.0</string>
            <key>VERSION</key>
            <string>latest</string>
            <key>INCLUDE_UPDATES</key>
            <true/>
            <key>RUM_ENABLED</key>
            <true/>
            <key>UPDATES_ENABLED</key>
            <false/>
            <key>APPS_PANEL_ENABLED</key>
            <false/>
            <key>ADMIN_PRIVILEGES_ENABLED</key>
            <false/>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>CreativeCloudFeed</string>
                <key>Arguments</key>
                <dict>
                    <key>product_id</key>
                    <string>%PRODUCT_ID%</string>
                    <key>base_version</key>
                    <string>%BASE_VERSION%</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CreativeCloudPackager</string>
                <key>Arguments</key>
                <dict>
                    <key>organization_name</key>
                    <string>%ORG_NAME%</string>
                    <key>package_name</key>
                    <string>%NAME%</string>
                    <key>customer_type</key>
                    <string>%LICENSE_TYPE%</string>
                    <key>include_updates</key>
                    <true/>
                    <key>rum_enabled</key>
                    <true/>
                    <key>updates_enabled</key>
                    <false/>
                    <key>apps_panel_enabled</key>
                    <false/>
                    <key>admin_privileges_enabled</key>
                    <false/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
